droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_adc_regs.xml
	<register id="ADCSOC1CTL" width="32" page="1" offset="0x12" internal="0" description="ADC SOC1 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC2CTL" width="32" page="1" offset="0x14" internal="0" description="ADC SOC2 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC3CTL" width="32" page="1" offset="0x16" internal="0" description="ADC SOC3 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC4CTL" width="32" page="1" offset="0x18" internal="0" description="ADC SOC4 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC5CTL" width="32" page="1" offset="0x1a" internal="0" description="ADC SOC5 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC6CTL" width="32" page="1" offset="0x1c" internal="0" description="ADC SOC6 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC7CTL" width="32" page="1" offset="0x1e" internal="0" description="ADC SOC7 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC8CTL" width="32" page="1" offset="0x20" internal="0" description="ADC SOC8 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC9CTL" width="32" page="1" offset="0x22" internal="0" description="ADC SOC9 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC10CTL" width="32" page="1" offset="0x24" internal="0" description="ADC SOC10 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC11CTL" width="32" page="1" offset="0x26" internal="0" description="ADC SOC11 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC12CTL" width="32" page="1" offset="0x28" internal="0" description="ADC SOC12 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC13CTL" width="32" page="1" offset="0x2a" internal="0" description="ADC SOC13 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
	<register id="ADCSOC14CTL" width="32" page="1" offset="0x2c" internal="0" description="ADC SOC14 Control Register">
		<bitfield id="ACQPS" description="SOC Acquisition Prescale" begin="8" end="0" width="9" rwaccess="R/W"/>
		<bitfield id="CHSEL" description="SOC Channel Select" begin="18" end="15" width="4" rwaccess="R/W"/>
		<bitfield id="TRIGSEL" description="SOC Trigger Source Select" begin="24" end="20" width="5" rwaccess="R/W"/>
	</register>
