droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_adc_regs.xml
	<register id="ADCCOUNTER" width="16" page="1" offset="0x39" internal="0" description="ADC Counter Register">
		<bitfield id="FREECOUNT" description="ADC Free Running Counter Value" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCREV" width="16" page="1" offset="0x3a" internal="0" description="ADC Revision Register">
		<bitfield id="TYPE" description="ADC Type" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="REV" description="ADC Revision" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="ADCOFFTRIM" width="16" page="1" offset="0x3b" internal="0" description="ADC Offset Trim Register">
		<bitfield id="OFFTRIM" description="ADC Offset Trim" begin="7" end="0" width="8" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB1CONFIG" width="16" page="1" offset="0x40" internal="0" description="ADC PPB1 Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block Configuration" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block Two's Complement Enable" begin="4" end="4" width="1" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB1STAMP" width="16" page="1" offset="0x41" internal="0" description="ADC PPB1 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB1OFFCAL" width="16" page="1" offset="0x42" internal="0" description="ADC PPB1 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB1OFFREF" width="16" page="1" offset="0x43" internal="0" description="ADC PPB1 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block Offset Reference" begin="15" end="0" width="16" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB1TRIPHI" width="32" page="1" offset="0x44" internal="0" description="ADC PPB1 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block Trip High Limit" begin="15" end="0" width="16" rwaccess="R/W"/>
		<bitfield id="HSIGN" description="High Limit Sign Bit" begin="16" end="16" width="1" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB1TRIPLO" width="32" page="1" offset="0x46" internal="0" description="ADC PPB1 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block Trip Low Limit" begin="15" end="0" width="16" rwaccess="R/W"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB2CONFIG" width="16" page="1" offset="0x48" internal="0" description="ADC PPB2 Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block Configuration" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block Two's Complement Enable" begin="4" end="4" width="1" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB2STAMP" width="16" page="1" offset="0x49" internal="0" description="ADC PPB2 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB2OFFCAL" width="16" page="1" offset="0x4a" internal="0" description="ADC PPB2 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB2OFFREF" width="16" page="1" offset="0x4b" internal="0" description="ADC PPB2 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block Offset Reference" begin="15" end="0" width="16" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB2TRIPHI" width="32" page="1" offset="0x4c" internal="0" description="ADC PPB2 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block Trip High Limit" begin="15" end="0" width="16" rwaccess="R/W"/>
		<bitfield id="HSIGN" description="High Limit Sign Bit" begin="16" end="16" width="1" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB2TRIPLO" width="32" page="1" offset="0x4e" internal="0" description="ADC PPB2 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block Trip Low Limit" begin="15" end="0" width="16" rwaccess="R/W"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB3CONFIG" width="16" page="1" offset="0x50" internal="0" description="ADC PPB3 Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block Configuration" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block Two's Complement Enable" begin="4" end="4" width="1" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB3STAMP" width="16" page="1" offset="0x51" internal="0" description="ADC PPB3 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB3OFFCAL" width="16" page="1" offset="0x52" internal="0" description="ADC PPB3 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB3OFFREF" width="16" page="1" offset="0x53" internal="0" description="ADC PPB3 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block Offset Reference" begin="15" end="0" width="16" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB3TRIPHI" width="32" page="1" offset="0x54" internal="0" description="ADC PPB3 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block Trip High Limit" begin="15" end="0" width="16" rwaccess="R/W"/>
		<bitfield id="HSIGN" description="High Limit Sign Bit" begin="16" end="16" width="1" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB3TRIPLO" width="32" page="1" offset="0x56" internal="0" description="ADC PPB3 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block Trip Low Limit" begin="15" end="0" width="16" rwaccess="R/W"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB4CONFIG" width="16" page="1" offset="0x58" internal="0" description="ADC PPB4 Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block Configuration" begin="3" end="0" width="4" rwaccess="R/W"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block Two's Complement Enable" begin="4" end="4" width="1" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB4STAMP" width="16" page="1" offset="0x59" internal="0" description="ADC PPB4 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB4OFFCAL" width="16" page="1" offset="0x5a" internal="0" description="ADC PPB4 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB4OFFREF" width="16" page="1" offset="0x5b" internal="0" description="ADC PPB4 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block Offset Reference" begin="15" end="0" width="16" rwaccess="R/W"/>
	</register>
