droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_adc_regs.xml
	<register id="ADCPPB4TRIPHI" width="32" page="1" offset="0x5c" internal="0" description="ADC PPB4 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block Trip High Limit" begin="15" end="0" width="16" rwaccess="R/W"/>
		<bitfield id="HSIGN" description="High Limit Sign Bit" begin="16" end="16" width="1" rwaccess="R/W"/>
	</register>
	<register id="ADCPPB4TRIPLO" width="32" page="1" offset="0x5e" internal="0" description="ADC PPB4 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block Trip Low Limit" begin="15" end="0" width="16" rwaccess="R/W"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCINLTRIM1" width="32" page="1" offset="0x70" internal="0" description="ADC Linearity Trim 1 Register">
		<bitfield id="INLTRIM31TO0" description="ADC Linearity Trim Bits 31-0" begin="31" end="0" width="32" rwaccess="R/W"/>
	</register>
	<register id="ADCINLTRIM2" width="32" page="1" offset="0x72" internal="0" description="ADC Linearity Trim 2 Register">
		<bitfield id="INLTRIM63TO32" description="ADC Linearity Trim Bits 63-32" begin="31" end="0" width="32" rwaccess="R/W"/>
	</register>
	<register id="ADCINLTRIM3" width="32" page="1" offset="0x74" internal="0" description="ADC Linearity Trim 3 Register">
		<bitfield id="INLTRIM95TO64" description="ADC Linearity Trim Bits 95-64" begin="31" end="0" width="32" rwaccess="R/W"/>
	</register>
	<register id="ADCINLTRIM4" width="32" page="1" offset="0x76" internal="0" description="ADC Linearity Trim 4 Register">
		<bitfield id="INLTRIM127TO96" description="ADC Linearity Trim Bits 127-96" begin="31" end="0" width="32" rwaccess="R/W"/>
	</register>
	<register id="ADCINLTRIM5" width="32" page="1" offset="0x78" internal="0" description="ADC Linearity Trim 5 Register">
		<bitfield id="INLTRIM159TO128" description="ADC Linearity Trim Bits 159-128" begin="31" end="0" width="32" rwaccess="R/W"/>
	</register>
	<register id="ADCINLTRIM6" width="32" page="1" offset="0x7a" internal="0" description="ADC Linearity Trim 6 Register">
		<bitfield id="INLTRIM191TO160" description="ADC Linearity Trim Bits 191-160" begin="31" end="0" width="32" rwaccess="R/W"/>
	</register>
</module>
